HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEray_reg.h
/**
 * \file IfxEray_reg.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Eray_Registers_Cfg Eray address
 * \ingroup IfxSfr_Eray_Registers
 * 
 * \defgroup IfxSfr_Eray_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Eray_Registers_Cfg
 *
 * \defgroup IfxSfr_Eray_Registers_Cfg_Eray0 2-ERAY0
 * \ingroup IfxSfr_Eray_Registers_Cfg
 *
 *
 */
#ifndef IFXERAY_REG_H
#define IFXERAY_REG_H 1
/******************************************************************************/
#include "IfxEray_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Eray_Registers_Cfg_BaseAddress
 * \{  */

/** \brief ERAY object */
#define MODULE_ERAY0 /*lint --e(923, 9078)*/ ((*(Ifx_ERAY*)0xF001C000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Eray_Registers_Cfg_Eray0
 * \{  */
/** \brief 0, Clock Control Register */
#define ERAY0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CLC*)0xF001C000u)

/** \brief 4, Busy and Input Buffer Control Register */
#define ERAY0_CUST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CUST1*)0xF001C004u)

/** \brief 8, Module Identification Register */
#define ERAY0_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ID*)0xF001C008u)

/** \brief C, Customer Interface Timeout Counter Register */
#define ERAY0_CUST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CUST3*)0xF001C00Cu)

/** \brief 10, Test Register 1 */
#define ERAY0_TEST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TEST1*)0xF001C010u)

/** \brief 14, Test Register 2 */
#define ERAY0_TEST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TEST2*)0xF001C014u)

/** \brief 1C, Lock Register */
#define ERAY0_LCK /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_LCK*)0xF001C01Cu)

/** \brief 20, Error Service Request Select Register */
#define ERAY0_EIR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EIR*)0xF001C020u)

/** \brief 24, Status Service Request Register */
#define ERAY0_SIR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SIR*)0xF001C024u)

/** \brief 28, Error Service Request Line Select */
#define ERAY0_EILS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EILS*)0xF001C028u)

/** \brief 2C, Status Service Request Line Select */
#define ERAY0_SILS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SILS*)0xF001C02Cu)

/** \brief 30, Error Service Request Enable Set */
#define ERAY0_EIES /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EIES*)0xF001C030u)

/** \brief 34, Error Service Request Enable Reset */
#define ERAY0_EIER /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EIER*)0xF001C034u)

/** \brief 38, Status Service Request Enable Set */
#define ERAY0_SIES /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SIES*)0xF001C038u)

/** \brief 3C, Status Service Request Enable Reset */
#define ERAY0_SIER /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SIER*)0xF001C03Cu)

/** \brief 40, Service Request Line Enable */
#define ERAY0_ILE /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ILE*)0xF001C040u)

/** \brief 44, Timer 0 Configuration */
#define ERAY0_T0C /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_T0C*)0xF001C044u)

/** \brief 48, Timer 1 Configuration */
#define ERAY0_T1C /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_T1C*)0xF001C048u)

/** \brief 4C, Stop Watch Register 1 */
#define ERAY0_STPW1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_STPW1*)0xF001C04Cu)

/** \brief 50, Stop Watch Register 2 */
#define ERAY0_STPW2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_STPW2*)0xF001C050u)

/** \brief 80, SUC Configuration Register 1 */
#define ERAY0_SUCC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SUCC1*)0xF001C080u)

/** \brief 84, SUC Configuration Register 2 */
#define ERAY0_SUCC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SUCC2*)0xF001C084u)

/** \brief 88, SUC Configuration Register 3 */
#define ERAY0_SUCC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SUCC3*)0xF001C088u)

/** \brief 8C, NEM Configuration Register */
#define ERAY0_NEMC /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NEMC*)0xF001C08Cu)

/** \brief 90, PRT Configuration Register 1 */
#define ERAY0_PRTC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_PRTC1*)0xF001C090u)

/** \brief 94, PRT Configuration Register 2 */
#define ERAY0_PRTC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_PRTC2*)0xF001C094u)

/** \brief 98, MHD Configuration Register */
#define ERAY0_MHDC /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MHDC*)0xF001C098u)

/** \brief A0, GTU Configuration Register 1 */
#define ERAY0_GTUC01 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC01*)0xF001C0A0u)

/** \brief A4, GTU Configuration Register 2 */
#define ERAY0_GTUC02 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC02*)0xF001C0A4u)

/** \brief A8, GTU Configuration Register 3 */
#define ERAY0_GTUC03 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC03*)0xF001C0A8u)

/** \brief AC, GTU Configuration Register 4 */
#define ERAY0_GTUC04 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC04*)0xF001C0ACu)

/** \brief B0, GTU Configuration Register 5 */
#define ERAY0_GTUC05 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_GTUC05*)0xF001C0B0u)

